Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ЗакрытиеМесяца/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправленческийОстатки.Счет КАК Счет,
		|	УправленческийОстатки.СуммаОстатокДт КАК ОстатокДт,
		|	УправленческийОстатки.СуммаОстатокКт КАК ОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Остатки(&МоментВремени, Счет В (&СчетЗатратНаПродажу, &СчетВыручка, &СчетСебестоимость), , ) КАК УправленческийОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", КонецМесяца(Дата)+1);
	Запрос.УстановитьПараметр("СчетВыручка", ПланыСчетов.Основной.Выручка);
	Запрос.УстановитьПараметр("СчетЗатратНаПродажу", ПланыСчетов.Основной.РасходыНаПродажу);
	Запрос.УстановитьПараметр("СчетСебестоимость", ПланыСчетов.Основной.Себестоимость);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	СуммаВыручки = 0;
	СуммаСебестоимости = 0;
	СуммаЗатрат = 0;
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Основной.Выручка Тогда
			СуммаВыручки = ВыборкаДетальныеЗаписи.ОстатокКт;                                                               
		ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Основной.Себестоимость Тогда
			СуммаСебестоимости = ВыборкаДетальныеЗаписи.ОстатокДт;
		ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Основной.РасходыНаПродажу Тогда
			СуммаЗатрат = ВыборкаДетальныеЗаписи.ОстатокДт;
		КонецЕсли;
	КонецЦикла;    
	
	
	//Регистр Управленческий
	Движения.Управленческий.Записывать = Истина;
	
	
    //Создаем движение по Выручке
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Основной.Выручка;
	Движение.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;
	Движение.Сумма = СуммаВыручки;
	Движение.СодержаниеОперации = "Закрытие месяца - Выручка";
	
	
	//Создаем движение по Себестоимости
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Основной.ПрибылиИУбытки;
	Движение.СчетКт = ПланыСчетов.Основной.Себестоимость;
	Движение.Сумма = СуммаСебестоимости;
	Движение.СодержаниеОперации = "Закрытие месяца - Себестоимость";

	
	//Создаем движение по Затратам на продажу
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Основной.ПрибылиИУбытки;
	Движение.СчетКт = ПланыСчетов.Основной.РасходыНаПродажу;
	Движение.Сумма = СуммаЗатрат;
	Движение.СодержаниеОперации = "Закрытие месяца - Затраты на продажу";
	
КонецПроцедуры
